In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    np.random.randint(10, size=(3, 3)), index=["a", "c", "e"], columns=["A", "B", "C"]
)

In [3]:
df

   A  B  C
a  1  4  4
c  7  2  0
e  0  3  1

In [4]:
df2 = df.reindex(["a", "b", "c", "d", "e", "f"])
df2

     A    B    C
a  1.0  4.0  4.0
b  NaN  NaN  NaN
c  7.0  2.0  0.0
d  NaN  NaN  NaN
e  0.0  3.0  1.0
f  NaN  NaN  NaN

In [7]:
df2.loc["d", "C"]=4.0
df2.loc["f", "B"]=2.0
df2

     A    B    C
a  1.0  4.0  4.0
b  NaN  NaN  NaN
c  7.0  2.0  0.0
d  NaN  NaN  4.0
e  0.0  3.0  1.0
f  NaN  2.0  NaN

In [8]:
df2.isnull()

       A      B      C
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True  False
e  False  False  False
f   True  False   True

In [9]:
#count number of missing values
df2.isnull().sum()

A    3
B    2
C    2
dtype: int64

In [10]:
#or rows
df2.isnull().sum(axis=1)

a    0
b    3
c    0
d    2
e    0
f    2
dtype: int64

In [11]:
#bring up missing values in column A
df2[df2["A"].isnull()]

    A    B    C
b NaN  NaN  NaN
d NaN  NaN  4.0
f NaN  2.0  NaN

In [12]:
#drop all rows with a missing value
df2.dropna()

     A    B    C
a  1.0  4.0  4.0
c  7.0  2.0  0.0
e  0.0  3.0  1.0

In [13]:
#drop row only if ALL values are missing
df2.dropna(how="all")

     A    B    C
a  1.0  4.0  4.0
c  7.0  2.0  0.0
d  NaN  NaN  4.0
e  0.0  3.0  1.0
f  NaN  2.0  NaN

In [15]:
#drop row if missing value in col A
df2.dropna(subset=["A"])

     A    B    C
a  1.0  4.0  4.0
c  7.0  2.0  0.0
e  0.0  3.0  1.0

In [16]:
#A OR B
df2.dropna(subset=["A", "B"])

     A    B    C
a  1.0  4.0  4.0
c  7.0  2.0  0.0
e  0.0  3.0  1.0

In [17]:
#A AND B
df2.dropna(subset=["A", "B"], how="all")

     A    B    C
a  1.0  4.0  4.0
c  7.0  2.0  0.0
e  0.0  3.0  1.0
f  NaN  2.0  NaN

In [18]:
#fill values rather than drop
df2.fillna(value=0)

     A    B    C
a  1.0  4.0  4.0
b  0.0  0.0  0.0
c  7.0  2.0  0.0
d  0.0  0.0  4.0
e  0.0  3.0  1.0
f  0.0  2.0  0.0